package com.lewis.firstPhase.baseDataStructure;

/**
 * Created by Administrator on 2016/11/18.
 * 2题
 int a=-1024;
 给出 a>>1与a>>>1的的结果，并且用位移方式图示解释
 整数1024的二进制表示为  0000 0000 0000 0000 0000 0100 0000 0000
 负数1024的二进制源码为  1000 0000 0000 0000 0000 0100 0000 0000
                反码为  1111 1111 1111 1111 1111 1011 1111 1111
                                      +  1
                补码为  1111 1111 1111 1111 1111 1100 0000 0000
 即-1024的二进制表示为   1111 1111 1111 1111 1111 1100 0000 0000
 a >> 1 的二进制表示为   1111 1111 1111 1111 1111 1110 0000 0000
 下面将a >> 1的二进制转换为十进制：
 规则：（最高位如果为1代表为负数，求值的时候，需要先把二进制的值按位取反，然后加1得到负数绝对值(相反数)的二进制码，然后转为10进制，加上负号即可）
           按位取反      0000 0000 0000 0000 0000 0001 1111 1111
            +1                                                +1
 负数绝对值的二进制       0000 0000 0000 0000 0000 0010 0000 0000
 上面的用十进制表示为512，加上负号即-512

无符号右移规则：始终补0
 即-1024的二进制表示为   1111 1111 1111 1111 1111 1100 0000 0000
 a >>> 1的二进制表示为   0111 1111 1111 1111 1111 1110 0000 0000
 a >>> 1的十进制表示为 2147483136
 */
public class SecondTopic {

    public static void main(String[] args) {
        int a = -1024;
        System.out.println(a >> 1);
        System.out.println(a >>> 1);
    }

}
